Revit 2027 API
RebarContainerParameterManager.IsRebarContainerParameter Method
 Checks if the parameter is a Rebar Container parameter
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRebarContainerParameter(
	ElementId paramId
)
Public Function IsRebarContainerParameter (
	paramId As ElementId
) As Boolean
public:
bool IsRebarContainerParameter(
	ElementId^ paramId
)
member IsRebarContainerParameter :
        paramId : ElementId -> bool
Parameters
paramId ElementId
 The id of the parameter element
Return Value
Boolean
 True if the parameter is a Rebar Container parameter
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace